wyniki_50G_article/fio_results_btrfs_ssd/block_size_65536/lab-sec-11/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 51200MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=99223: Mon Apr 21 08:56:32 2025
  write: IOPS=11.2k, BW=43.6MiB/s (45.7MB/s)(7850MiB/180001msec); 0 zone resets
    slat (usec): min=8, max=312, avg=21.54, stdev=17.85
    clat (usec): min=22, max=564091, avg=66.70, stdev=2132.37
     lat (usec): min=37, max=564106, avg=88.24, stdev=2132.78
    clat percentiles (usec):
     |  1.00th=[   38],  5.00th=[   40], 10.00th=[   40], 20.00th=[   42],
     | 30.00th=[   43], 40.00th=[   45], 50.00th=[   46], 60.00th=[   48],
     | 70.00th=[   52], 80.00th=[   57], 90.00th=[   65], 95.00th=[   92],
     | 99.00th=[  174], 99.50th=[  190], 99.90th=[ 2802], 99.95th=[ 4228],
     | 99.99th=[ 5669]
   bw (  KiB/s): min=  136, max=76376, per=100.00%, avg=44711.49, stdev=22766.75, samples=359
   iops        : min=   34, max=19094, avg=11177.87, stdev=5691.69, samples=359
  lat (usec)   : 50=65.80%, 100=29.78%, 250=4.26%, 500=0.02%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.06%, 10=0.05%, 20=0.01%, 50=0.01%
  lat (msec)   : 500=0.01%, 750=0.01%
  cpu          : usr=3.55%, sys=27.54%, ctx=2015965, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2009477,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=43.6MiB/s (45.7MB/s), 43.6MiB/s-43.6MiB/s (45.7MB/s-45.7MB/s), io=7850MiB (8231MB), run=180001-180001msec